/**********************************************************************************
// Food (Código Fonte)
//
// Criação:     03 Jan 2013
// Atualização: 25 Ago 2021
// Compilador:  Visual C++ 2019
//
// Descrição:   Comida do PacMan
//
**********************************************************************************/

#include "PacMan.h"
#include "Food.h"

// ---------------------------------------------------------------------------------

Food::Food(Image* img)
{
	sprite = new Sprite(img);

	bbox = new Rect((float)-sprite->Width() / 2, (float)-sprite->Height() / 2, (float) sprite->Width() / 2, (float) sprite->Height() / 2);
	type = FOOD;
}

// ---------------------------------------------------------------------------------

Food::~Food()
{
	delete sprite;
	delete bbox;
}

// ---------------------------------------------------------------------------------

void Food::Update()
{

}

// ---------------------------------------------------------------------------------
